{
  "generated_utc": "2025-12-18T00:52:55.500030Z",
  "tools": [
    {
      "name": "securityevent_last_24h",
      "action": "kql.read.SecurityEvent",
      "table": "SecurityEvent",
      "template": "SecurityEvent\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "securityevent_last_7d",
      "action": "kql.read.SecurityEvent",
      "table": "SecurityEvent",
      "template": "SecurityEvent\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "securityevent_last_30d",
      "action": "kql.read.SecurityEvent",
      "table": "SecurityEvent",
      "template": "SecurityEvent\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "securityevent_last_180d",
      "action": "kql.read.SecurityEvent",
      "table": "SecurityEvent",
      "template": "SecurityEvent\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "securityincident_last_24h",
      "action": "kql.read.SecurityIncident",
      "table": "SecurityIncident",
      "template": "SecurityIncident\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "securityincident_last_7d",
      "action": "kql.read.SecurityIncident",
      "table": "SecurityIncident",
      "template": "SecurityIncident\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "securityincident_last_30d",
      "action": "kql.read.SecurityIncident",
      "table": "SecurityIncident",
      "template": "SecurityIncident\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "securityincident_last_180d",
      "action": "kql.read.SecurityIncident",
      "table": "SecurityIncident",
      "template": "SecurityIncident\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "sentinelaudit_last_24h",
      "action": "kql.read.SentinelAudit",
      "table": "SentinelAudit",
      "template": "SentinelAudit\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "sentinelaudit_last_7d",
      "action": "kql.read.SentinelAudit",
      "table": "SentinelAudit",
      "template": "SentinelAudit\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "sentinelaudit_last_30d",
      "action": "kql.read.SentinelAudit",
      "table": "SentinelAudit",
      "template": "SentinelAudit\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "sentinelaudit_last_180d",
      "action": "kql.read.SentinelAudit",
      "table": "SentinelAudit",
      "template": "SentinelAudit\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "azureactivity_last_24h",
      "action": "kql.read.AzureActivity",
      "table": "AzureActivity",
      "template": "AzureActivity\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "azureactivity_last_7d",
      "action": "kql.read.AzureActivity",
      "table": "AzureActivity",
      "template": "AzureActivity\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "azureactivity_last_30d",
      "action": "kql.read.AzureActivity",
      "table": "AzureActivity",
      "template": "AzureActivity\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "azureactivity_last_180d",
      "action": "kql.read.AzureActivity",
      "table": "AzureActivity",
      "template": "AzureActivity\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "signinlogs_last_24h",
      "action": "kql.read.SigninLogs",
      "table": "SigninLogs",
      "template": "SigninLogs\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "signinlogs_last_7d",
      "action": "kql.read.SigninLogs",
      "table": "SigninLogs",
      "template": "SigninLogs\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "signinlogs_last_30d",
      "action": "kql.read.SigninLogs",
      "table": "SigninLogs",
      "template": "SigninLogs\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "signinlogs_last_180d",
      "action": "kql.read.SigninLogs",
      "table": "SigninLogs",
      "template": "SigninLogs\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "deviceevents_last_24h",
      "action": "kql.read.DeviceEvents",
      "table": "DeviceEvents",
      "template": "DeviceEvents\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "deviceevents_last_7d",
      "action": "kql.read.DeviceEvents",
      "table": "DeviceEvents",
      "template": "DeviceEvents\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "deviceevents_last_30d",
      "action": "kql.read.DeviceEvents",
      "table": "DeviceEvents",
      "template": "DeviceEvents\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "deviceevents_last_180d",
      "action": "kql.read.DeviceEvents",
      "table": "DeviceEvents",
      "template": "DeviceEvents\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aaduserriskevents_last_24h",
      "action": "kql.read.AADUserRiskEvents",
      "table": "AADUserRiskEvents",
      "template": "AADUserRiskEvents\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aaduserriskevents_last_7d",
      "action": "kql.read.AADUserRiskEvents",
      "table": "AADUserRiskEvents",
      "template": "AADUserRiskEvents\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aaduserriskevents_last_30d",
      "action": "kql.read.AADUserRiskEvents",
      "table": "AADUserRiskEvents",
      "template": "AADUserRiskEvents\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aaduserriskevents_last_180d",
      "action": "kql.read.AADUserRiskEvents",
      "table": "AADUserRiskEvents",
      "template": "AADUserRiskEvents\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aadriskyusers_last_24h",
      "action": "kql.read.AADRiskyUsers",
      "table": "AADRiskyUsers",
      "template": "AADRiskyUsers\n| where TimeGenerated > ago(24h)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aadriskyusers_last_7d",
      "action": "kql.read.AADRiskyUsers",
      "table": "AADRiskyUsers",
      "template": "AADRiskyUsers\n| where TimeGenerated > ago(7d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aadriskyusers_last_30d",
      "action": "kql.read.AADRiskyUsers",
      "table": "AADRiskyUsers",
      "template": "AADRiskyUsers\n| where TimeGenerated > ago(30d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    },
    {
      "name": "aadriskyusers_last_180d",
      "action": "kql.read.AADRiskyUsers",
      "table": "AADRiskyUsers",
      "template": "AADRiskyUsers\n| where TimeGenerated > ago(180d)\n| take {limit}",
      "default": {
        "limit": 20
      },
      "constraints": {
        "max_limit": 200
      }
    }
  ]
}
